Repository: common-repository/refgenerator
Catalog: langs/refgen-*.po
Languages: fr_fr

source: reference #
fr_fr: R&eacute;f&eacute;rence n&deg;

source: You have successfully uninstall RefGenerator settings.
fr_fr: Vous avez effacer les param&egrave;tres de RefGenerator de votre installation Wordpress.

source: You do not have the permission rights to edit refgenerator settings
fr_fr: Vous n'avez pas les permissions suffisantes pour &eacute;diter les param&egrave;tres de RefGenerator

source: RefGenerator Presentation
fr_fr: Pr&eacute;sentation de RefGenerator

source: Welcome to RefGenerator settings center and once again thank you for installing and activating my plugin.RefGenerator will help you provide automatically your post references.
fr_fr: Bienvenue dans la zone d'administration de RefGenerator et merci d'avoir installer mon plugin. Il va vous permettre de g&eacute;n&eacute;rer automatiquement les r&eacute;f&eacute;rences de vos billets.

source: This admin center will help you setup the plugin and check it against your active template ( HTML and CSS files ).
fr_fr: Ici, vous allez pouvoir param&eacute;trer le plugin et v&eacute;rifier que votre template (html et CSS) a tout ce qu'il faut pour utiliser RefGenerator.

source: You may choose between 2 methods to generate the list:
fr_fr: Vous avez deux modes d'affichage disponibles :

source: <strong>Simple Mode :</strong> it's the default mode because this one works almost out of the box.<br/><em>Of note,</em> not all the links will be shown ( ie additionals links produce by other plugin may not be shown).
fr_fr: <strong>Mode simple :</strong> je vous conseille de s&eacute;lectionner cette option, vous avez toutes les chances que &ccedil;a marche du premier coup ;)<br/><em>A savoir :</em> Avec cette m&eacute;thode, il y a un risque que vous n'obteniez pas toujours la liste compl&egrave;te de tous les liens ( ie. les liens externes cr&eacute;&eacute;s par d'autres plugin pourraient manquer ).

source: <strong>Advanced Mode :</strong> if you understand well wordpress template engine and are able update them, this method is for you<br/><em>Of note,</em> all external links will be shown but you need a javascript enable browser to show the final listing.
fr_fr: <strong>Mode avanc&eacute;:</strong> si vous savez trifouiller dans votre template, ce mode est fait pour vous, mais il requiert quelques connaissances techniques.<br/><em>A savoir :</em> Avec cette m&eacute;thode, tous les liens seront r&eacute;pertori&eacute;s ind&eacute;pendamment de vos plugins, mais ils ne seront visibles que sur un navigateur avec le javascript activ&eacute;.

source: Now that you know everything let's configure the plugin :
fr_fr: Maintenant que les pr&eacute;sentations sont faites, passons &agrave; la configuration :

source: Set Up RefGenerator
fr_fr: Configuration de RefGenerator

source: Choose the section title
fr_fr: Choisir le titre du plugin

source: This title will appear as refgenerator section title in your post.
fr_fr: Ce texte servira de titre &agrave; la liste g&eacute;n&eacute;r&eacute;e par Refgenerator

source: Choose your display method
fr_fr: Choisir la m&eacute;thode d'affichage

source: Generated the list using:
fr_fr: G&eacute;n&eacute;rer la liste en utilisant:

source: the Simple Mode
fr_fr: Le Mode Simple

source: the Advanced Mode
fr_fr: Le Mode Avanc&eacute;

source: CSS class for the references container<sup>*</sup>:
fr_fr: valeur de l'attribut class de la balise div qui contient la liste<sup>*</sup>:

source: <sup>*</sup> leave this value unchanged if you don't know what to do
fr_fr: <sup>*</sup> laissez la valeur par d&eacute;faut si vous ne savez pas

source: Settings from you template
fr_fr: Param&egrave;tres de votre template

source: Advanced Mode only
fr_fr: Uniquement avec le Mode Avanc&eacute;

source: id attribute for all posts container:
fr_fr: l'attribut id de la balise qui contient tous les articles:

source: post content container tag name:
fr_fr: nom de la balise qui contient le texte d'un article:

source: post content container class name:
fr_fr: valeur de l'attribut class de la balise qui contient le texte d'un article:

source: If some of these values does not exist for your template, please add them in your template to enable the Advanced Mode.
fr_fr: Si certaines des valeurs ci-dessus n'existe pas pour votre template, veuillez les rajouter pour utiliser le Mode Avanc&eacute;.

source: Update Options
fr_fr: Mettre &agrave; jour les options

source: Troubleshootings
fr_fr: En cas de probl&egrave;me

source: If for no reason at all the plugin does not display the list, check the presence of the code hereafter in the <code>footer.php</code> file of your template.
fr_fr: Si rien ne s'affiche, v&eacute;rifier la pr&eacute;sence du code ci-dessous dans le fichier <code>footer.php</code> de votre template

source: If this code is not present just add it before the <code>&lt;/body&gt;</code> tag.
fr_fr: Si ce code n'est pas pr&eacute;sent, ajoutez-le juste avant la balise <code>&lt;/body&gt;</code> du fichier.

source: When to display the list
fr_fr: Quand montrer RefGenerator

source: RefGenerator list appears at the end of the article. Depending on your theme and audience you may wish to display refgenerator list on :
fr_fr: La liste g&eacute;n&eacute;r&eacute;e par RefGenerator apparait en fin d'article. En fonction de votre th&egrave;me et/ou de votre audience veuillez s&eacute;lectionner la ou les pages sur lesquelles le plugin sera en action :

source: the home page
fr_fr: la page principale de votre blog

source: the single page
fr_fr: la page individuelle de l'article

source: the static page
fr_fr: les pages "statiques" de WordPress

source: the category page
fr_fr: les pages d'archives par cat&eacute;gories

source: the search page
fr_fr: les pages de r&eacute;sultats de recherche

source: the archives by date page
fr_fr: les pages d'archives par date

source: the archives by tag page
fr_fr: les pages d'archives par tag

source: or on every page
fr_fr: sur toute les pages du blog

source: By choosing this settings you will overide all other settings
fr_fr: Si vous selectionnez ce param&egrave;tre, les autres param&eacute;tres de cette cat&eacute;gorie seront r&eacute;-initialis&eacute;s

source: RefGenerator Deactivation
fr_fr: D&eacute;sinstallation de RefGenerator

source: You will completely remove all RefGenerator settings and be redirected to the plugin interface to de-install RefGenerator from your blog
fr_fr: Vous allez effacer tous les param&egrave;tres de configuration de RefGenerator et &ecirc;tre redirig&eacute; vers l'interface de gestion des plugins pour d&eacute;sinstaller RefGenerator

source: Deinstall RefGenerator
fr_fr: D&eacute;sinstaller RefGenerator

source: Are you sure you want to\n- Deinstall RefGenerator\n- Completely remove all its settings ?
fr_fr: Etes-vous sure de vouloir :\n- Desinstaller RefGenerator\n- Effacer completement tous les parametres du plugin ?
